Revit 2027 API
BuiltInFailures.StairRampFailures.CannotOffsetRail Property
 Can't create one or more Rails with desired offset
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotOffsetRail { get; }
Public Shared ReadOnly Property CannotOffsetRail As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotOffsetRail {
	FailureDefinitionId^ get ();
}
static member CannotOffsetRail : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace